Ruby/rails/simplecd/app/controllers/cds_controller.rb

  def new
    @cd = Cd.new
    @artists = Artist.all
---
SELECT * FROM `artists`